//   "",　この中に入れる。
const station = [

  // 山手線
  "池袋","大塚","巣鴨","駒込","田端","西日暮里","日暮里","鶯谷","上野","御徒町",
  "秋葉原","神田","東京","有楽町","新橋","浜松町","田町","高輪ゲートウェイ",
  "品川","大崎","五反田","目黒","恵比寿","渋谷","原宿","代々木","新宿",
  "新大久保","高田馬場","目白",

  // 京浜東北
  "大宮","さいたま新都心","与野","北浦和","浦和","南浦和","蕨","西川口","川口",
  "赤羽","東十条","王子","上中里","田端","西日暮里","日暮里","鶯谷","上野",
  "御徒町","秋葉原","神田","東京","有楽町","新橋","浜松町","田町",
  "高輪ゲートウェイ","品川","大井町","大森","蒲田","川崎","鶴見","新子安",
  "東神奈川","横浜",

  // 常磐線など
  "品川","新橋","東京","上野","日暮里","三河島","南千住","北千住","松戸","柏",
  "我孫子","天王台","取手","湖北","新木","布佐","木下","小林","安食",
  "下総松崎","成田",

  // 湘南新宿ライン
  "宇都宮","雀宮","石橋","自治医大","小金井","小山","間々田","野木","古河","栗橋",
  "東鷲宮","久喜","新白岡","白岡","蓮田","東大宮","土呂","前橋","新前橋","井野",
  "高崎問屋町","高崎","倉賀野","新町","神保原","本庄","岡部","深谷","龍原",
  "熊谷","行田","吹上","北鴻巣","鴻巣","北本","桶川","北上尾","上尾","宮原",
  "大宮","浦和","赤羽","池袋","新宿","渋谷","恵比寿","大崎","西大井",
  "武蔵小杉","新川崎","横浜","保土ヶ谷","東戸塚","戸塚","大船","北鎌倉",
  "鎌倉","逗子","藤沢","辻堂","茅ヶ崎","平塚","大磯","二宮","国府津",
  "鴨宮","小田原",

  // 西武新宿線
  "西武新宿","高田馬場","下落合","中井","新井薬師前","沼袋","野方","都立家政",
  "鷺ノ宮","下井草","井荻","上井草","上石神井","武蔵関","東伏見","西武柳沢",
  "田無","花小金井","小平","久米川","東村山","所沢","航空公園","新所沢",
  "入曽","狭山市","南大塚","本川越",

  // 西武拝島線
  "小平","萩山","小川","東大和市","玉川上水","武蔵砂川","西武立川","拝島",

  // 西武池袋線
  "池袋","椎名町","東長崎","江古田","桜台","練馬","中村橋","富士見台",
  "練馬高野台","石神井公園","大泉学園","保谷","ひばりヶ丘","東久留米",
  "清瀬","秋津","所沢","西所沢","小手指","狭山ヶ丘","武蔵藤沢",
  "稲荷山公園","入間市","仏子","元加治","飯能",

  // 千代田線・常磐各停
  "代々木上原","代々木公園","明治神宮前","表参道","乃木坂","赤坂",
  "国会議事堂前","霞ヶ関","日比谷","二重橋前","大手町","新御茶ノ水",
  "湯島","根津","西日暮里","町屋","北千住","綾瀬","北綾瀬","亀有",
  "金町","松戸","北松戸","馬橋","新松戸","北小金","南柏","柏",
  "北柏","我孫子","天王台","取手",

//中央線
"東京","神田","御茶ノ水","四ツ谷","新宿","中野","高円寺","阿佐ヶ谷","荻窪","西荻窪","吉祥寺","三鷹","武蔵境","東小金井","武蔵小金井","国分寺","西国分寺","国立","立川","日野","豊田","八王子","西八王子","高尾",

//東海道線
"東京","新橋","品川","川崎","横浜","戸塚","大船","藤沢","辻堂","茅ヶ崎","大磯","二宮","国府津","鴨宮","小田原","早川","真鶴","湯河原","熱海",

//伊東線
"熱海","来宮","伊豆多賀","網代","宇佐美","伊東",

//横須賀線
"東京","新橋","品川","西大井","武蔵小杉","新川崎","横浜","保土ヶ谷","東戸塚","戸塚","大船","北鎌倉","鎌倉","逗子","東逗子","田浦","横須賀","衣笠","久里浜",

//総武線快速
"稲毛","津田沼","船橋","市川","新小岩","錦糸町","馬喰町","新日本橋","東京",

//総武線各駅停車
"三鷹","吉祥寺","西荻窪","荻窪","阿佐ヶ谷","高円寺","中野","東中野","大久保","新宿","代々木","千駄ヶ谷","信濃町","四ツ谷","市ヶ谷","飯田橋","水道橋","御茶ノ水","秋葉原","浅草橋","両国","錦糸町","亀戸","平井","新小岩","小岩","市川","本八幡","下総中山","西船橋","船橋","東船橋","津田沼","幕張本郷","幕張","新検見川","稲毛","西千葉","千葉",

//鶴見線
"鶴見","国道","鶴見小野","弁天橋","朝野","安善","武蔵白石","浜川崎","昭和","扇町","新芝浦","大川",

//埼京線
"大崎","恵比寿","渋谷","原宿","新宿","池袋","板橋","十条","赤羽","北赤羽","浮間舟渡","戸田公園","戸田","北戸田","武蔵浦和","中浦和","南与野","与野本町","北与野","大宮",

//武蔵野線
"府中本町","北府中","西国分寺","新小平","新秋津","東所沢","新座","北朝霧","西浦和","武蔵浦和","南浦和","東浦和","東川口","南越谷","越谷レイクタウン","吉川","吉川美南","新三郷","三郷","南流産","新松戸","新八柱","東松戸","市川大野","船橋法典","西船橋","南船橋","新習志野","幕張豊砂","海浜幕張","市川塩浜","新浦安","舞浜","葛西臨海公園","新木場","潮見","越中島","八丁堀","東京"

];


