//“で囲って,で区切る
//   station.push()    “”,
//山の手

const station = {”池袋”,”大塚”,”巣鴨”,”駒込”,”田端”,”西日暮里”,”日暮里”,”鶯谷”,”上野”,“御徒町”,“秋葉原”,”神田”,”東京”,”有楽町”,”新橋”,”浜松町”,”田町”,”高輪ゲートウェイ”,”品川”,”大崎”,”五反田”,”目黒”,”恵比寿”,”渋谷”,”原宿”,”代々木”,”新宿”,”新大久保”,”高田馬場”,”目白”};

//京浜東北


station.push(”大宮”,”さいたま新都心”,”与野”,”北浦和”,”浦和”,”南浦和”,”蕨”,”西川口”,”川口”,”赤羽”,”東十条”,”王子”,”上中里”,”田端”,”西日暮里”,”日暮里”,”鶯谷”,”上野”,”御徒町”,”秋葉原”,”神田”,”東京”,”有楽町”,”新橋”,”浜松町”,”田町”,”高輪ゲートウェイ”,”品川”,”大井町”,”大森”,”蒲田”,”川崎”,”鶴見”,”新子安”,”東神奈川”,”横浜”);


//常磐、上野東京、成田

station.push(”品川”,”新橋”,”東京”,”上野”,”日暮里”,”三河島”,”南千住”,”北千住”,”松戸”,”柏”,”我孫子”,”天王台”,”取手”,”湖北”,”新木”,”布佐”,”木下”,”小林”,”安食”,”下総松崎”,”成田”);

//湘南新宿ライン

station.push(”宇都宮”,”雀宮”,”石橋”,”自治医大”,”小金井”,”小山”,”間々田”,”野木”,”古河”,”栗橋”,”東鷲宮”,”久喜”,”新白岡”,”白岡”,”蓮田”,”東大宮”,”土呂”,”前橋”,”新前橋”,”井野”,”高崎問屋町”,”高崎”,”倉賀野”,”新町”,”神保原”,”本庄”,”岡部”,”深谷”,”龍原”,”熊谷”,”行田”,”吹上”,”北鴻巣”,”鴻巣”,”北本”,”桶川”,”北上尾”,”上尾”,”宮原”,”大宮”,”浦和”,”赤羽”,”池袋”,”新宿”,”渋谷”,”恵比寿”,”大崎”,”西大井”,”武蔵小杉”,”新川崎”,”横浜”,”保土ヶ谷”,”東戸塚”,”戸塚”,”大船”,”北鎌倉”,”鎌倉”,”逗子”,”藤沢”,”辻堂”,”茅ヶ崎”,”平塚”,”大磯”,”二宮”,”国府津”,”鴨宮”,”小田原”);

//西武新宿線

station.push(“西武新宿”,“高田馬場”,“下落合”,“中井”,“新井薬師前”,“沼袋”,“野方”,“都立家政”,“鷹ノ宮”,“下井草”,“井荻”,“上井草”,“上石神井”,“武蔵関”,“東伏見”,“西武柳沢”,“田無”,“花小金井”,“小平”,“久米川”,“東村山”,“所沢”,“航空学園”,“新所沢”,“入曽”,“狭山市”,“南大塚”,“本川越”);

//西武拝島線
station.push(“小平”,“荻山”,“小川”,“東大和市”,“玉川上水”,“武蔵砂川”,“西武立川”,“拝島”);

//西武池袋線
station.push(“池袋”,“椎名町”,“東長崎”,“江古田”,“桜台”,“練馬”,“中村橋”,“富士見台”,“練馬高野台”,“石神井公園”,“大泉学園”,“保谷”,“ひばりヶ丘”,“東久留米”,“清瀬”,“秋津”,“所沢”,“西所沢”,“小手指”,“狭山ヶ丘”,“武蔵藤沢”,“稲荷山公園”,“入間市”,“仏子”,“元加治”,“飯能”);

//千代田線、常磐各駅停車
station.push(“代々木上原”,“代々木公園”,“明治神宮前”,“表参道”,“乃木坂”,“赤坂”,“国会議事堂前”,“霞ヶ関”,“日比谷”,“二重橋前”,“大手町”,“新御茶ノ水”,“湯島”,“根津”,“西日暮里”,“町屋”,“北千住”,“綾瀬”,“北綾瀬”,“亀有”,“金町”,“松戸”,“北松戸”,“馬橋”,“新松戸”,“北小金”,“南柏”,“柏”,“北柏”,“我孫子”,“天王台”,“取手”);
